DataProcessors/РСК_ЗаполнениеФормыОтчетаExcelДляФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>РСК_ЗаполнениеФормыОтчетаExcelДляФСС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиНачалаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиКонецДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиСНаправлением</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиНомерАкта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиДатаАкта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контракт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеФайла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНаправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиВФайле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаАкта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерАкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ПоручениеЭкспедитору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоручениеЭкспедитору</Name>
			<RegisterRecords>
				<xr:Item>InformationRegister.РСК_СтатусыВыполненияКонтрактов</xr:Item>
				<xr:Item>InformationRegister.РСК_АктВыдачиТСР</xr:Item>
				<xr:Item>AccumulationRegister.РСК_СостояниеЗаказовКлиентовПоВыдаче</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформацияПоДоставке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пункт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_АктВыдачиТСР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_СтатусАктаВыдачиТСР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РСК_СтатусыАктовВыдачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ТСР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДатаНаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерЗаявки</Name>
					<Comment>РС Консалт: Трофимов Евгений 12.11.2022 Задача 21867</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РСК_ЗаполнениеФормыОтчетаExcelДляФСС/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьФайл(Команда)
	
	ФайлСДанными = Новый Файл(Объект.ИмяФайла);
	Если НЕ ФайлСДанными.Существует() Тогда
		Сообщить("Указанного файла не существует!",СтатусСообщения.Важное);
		Возврат
	КонецЕсли;
	
	Если Объект.НомерСтрокиКонецДанных = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Укажите номер строки конца данных.";
		Сообщение.Поле = "НомерСтрокиКонецДанных";
		
		// Привязка объекта к реквизиту формы "вручную"
		//Сообщение.КлючДанных = Объект.Ссылка;
		Сообщение.ПутьКДанным = "Объект.НомерСтрокиКонецДанных";
		
		// Сообщение выводится пользователю
		Сообщение.Сообщить();

		Возврат	
	КонецЕсли;
	
	Объект.Расширение = ФайлСДанными.Расширение; 
	ДанныеФайла = Новый ДвоичныеДанные(Объект.ИмяФайла);
	
	ПрочитатьФайлНаСервере(ДанныеФайла);
	ЗаписатьНомерДатуАктаВФайл();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере(ДанныеФайла)
	
	Объект.ДанныеФайла.Очистить();
	
	//ИмяВременногоФайла = КаталогВременныхФайлов()+Прав(Строка(Новый УникальныйИдентификатор),8)+".xlsx";
	ИмяВременногоФайла = КаталогВременныхФайлов()+Прав(Строка(Новый УникальныйИдентификатор),8)+Объект.расширение;
	ДанныеФайла.Записать(ИмяВременногоФайла);
	
	ТабДокумент	= Новый ТабличныйДокумент;
	ТабДокумент.Прочитать(ИмяВременногоФайла);
	
	//ВсегоСтрок = ТабДокумент.ВысотаТаблицы;
	                  
	Для НомерСтроки = Объект.НомерСтрокиНачалаДанных По Объект.НомерСтрокиКонецДанных Цикл
		
		Если СокрЛП(ТабДокумент.Область(НомерСтроки,12,НомерСтроки,12).Текст) = "" Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока	= Объект.ДанныеФайла.Добавить();
		
		НоваяСтрока.НомерНаправления  =  ТабДокумент.Область(НомерСтроки,Объект.НомерКолонкиСНаправлением,НомерСтроки,Объект.НомерКолонкиСНаправлением).Текст;
		НоваяСтрока.НомерСтрокиВФайле =  НомерСтроки;
		НоваяСтрока.НомерАкта         =  ПолучитьНомерАктаПоНаправлению(НоваяСтрока.НомерНаправления);
		
		//Трофимов: 17.06.2022 Ольга Полянская попросила брать дату акта
		//НоваяСтрока.ДатаАкта          =  Объект.ДатаВыдачи;
		НоваяСтрока.ДатаАкта 		  =  ПолучитьДатуАктаПоНаправлению(НоваяСтрока.НомерНаправления);
	КонецЦикла; 
	
	УдалитьФайлы(КаталогВременныхФайлов(),ИмяВременногоФайла);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНомерДатуАктаВФайл()
	Попытка
		Excel = Новый COMОбъект("Excel.Application"); 
		Excel.DisplayAlerts = 0;
		Excel.EnableEvents = 0; 
		Excel.ScreenUpdating = 0;
		Excel.Visible = 0;
		
	Исключение
		Сообщить(ОписаниеОшибки() + "Возможно программа Exсel не установлена на данном компьютере!");
		Возврат ;
	КонецПопытки;
	
	//Открытие существующей книги  
	Попытка
		Книга = Excel.Workbooks.Open(Объект.ИмяФайла);
		//Книга = ПолучитьCOMОбъект(Объект.ИмяФайла);
				
		//Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка
		//Открываем необходимый лист
		Лист = Книга.Worksheets(1); // лист 1, по умолчанию
		Для Каждого Строка Из Объект.ДанныеФайла Цикл
			Лист.Cells(Строка.НомерСтрокиВФайле, Объект.НомерКолонкиНомерАкта).Value  = Строка.НомерАкта;
			
			Лист.Cells(Строка.НомерСтрокиВФайле, Объект.НомерКолонкиДатаАкта).NumberFormat = "ДД.ММ.ГГГГ";
			Лист.Cells(Строка.НомерСтрокиВФайле, Объект.НомерКолонкиДатаАкта).Value        = Формат(Строка.ДатаАкта, "ДФ=dd.MM.yyyy");  
		КонецЦикла
	Исключение
		//Закрываем Excel
		//Excel.ActiveWorkbook.Close();
		Excel.Quit();
		//Excel = 0;
		Сообщить("Файл " + Строка(Объект.ИмяФайла) + " не соответствует необходимому формату! Первый лист не найден!");
		Возврат;
	КонецПопытки;
	
	Попытка
		Книга.SaveAs(Объект.ИмяФайла);
		Сообщить("Файл " + Объект.ИмяФайла + " успешно сохранен"); 
	Исключение
		Сообщить(ОписаниеОшибки() + " Файл не сохранен!");
		Возврат;
	КонецПопытки;
	
	Попытка			
		Excel.Quit();
	Исключение			
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Excel'; en = 'Excel'") + "(*.xlsx)|*.xls;*.xlsx";
	ДиалогОткрытияФайла.Фильтр 				= Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор 	= Ложь;
	ДиалогОткрытияФайла.Заголовок 			= "Выберите файл с данными";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьДатуАктаПоНаправлению(НомерНаправления)
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	АктВыдачиТСР.Дата
	//	|ИЗ
	//	|	Документ.АктВыдачиТСР КАК АктВыдачиТСР
	//	|ГДЕ
	//	|	АктВыдачиТСР.НомерНаправления = &НомерНаправления
	//	|	И АктВыдачиТСР.Контракт = &Контракт
	//	|	И АктВыдачиТСР.Проведен";
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоручениеЭкспедитору.Дата КАК Дата
		|ИЗ
		|	Документ.ПоручениеЭкспедитору.Основания КАК ПоручениеЭкспедиторуОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ПО ПоручениеЭкспедиторуОснования.Ссылка = ПоручениеЭкспедитору.Ссылка
		|			И (ПоручениеЭкспедиторуОснования.НомерСтроки = 1)
		|ГДЕ
		|	ПоручениеЭкспедитору.РСК_НомерНаправления = &НомерНаправления
		|	И ПоручениеЭкспедиторуОснования.Основание = &Контракт
		|	И ПоручениеЭкспедитору.Проведен";
	
	Запрос.УстановитьПараметр("Контракт", Объект.Контракт);
	Запрос.УстановитьПараметр("НомерНаправления", НомерНаправления);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса[0].Дата;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьНомерАктаПоНаправлению(НомерНаправления)
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	АктВыдачиТСР.Номер 
	//	|ИЗ
	//	|	Документ.АктВыдачиТСР КАК АктВыдачиТСР
	//	|ГДЕ
	//	|	АктВыдачиТСР.НомерНаправления = &НомерНаправления
	//	|	И АктВыдачиТСР.Контракт = &Контракт
	//	|	И АктВыдачиТСР.Проведен";
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоручениеЭкспедитору.Номер КАК Номер
		|ИЗ
		|	Документ.ПоручениеЭкспедитору.Основания КАК ПоручениеЭкспедиторуОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ПО ПоручениеЭкспедиторуОснования.Ссылка = ПоручениеЭкспедитору.Ссылка
		|			И (ПоручениеЭкспедиторуОснования.НомерСтроки = 1)
		|ГДЕ
		|	ПоручениеЭкспедитору.РСК_НомерНаправления = &НомерНаправления
		|	И ПоручениеЭкспедиторуОснования.Основание = &Контракт
		|	И ПоручениеЭкспедитору.Проведен";
	
	Запрос.УстановитьПараметр("Контракт", Объект.Контракт);
	Запрос.УстановитьПараметр("НомерНаправления", НомерНаправления);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса[0].Номер
	Иначе
		Возврат "Номер не определен"
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Контракт") Тогда
		Объект.Контракт = Параметры.Контракт;
	КонецЕсли;
	Если Параметры.Свойство("ДатаВыдачи") Тогда
		Объект.ДатаВыдачи = Параметры.ДатаВыдачи;
	КонецЕсли;	
	
	////Колонки по умолчанию в первоначальном файле
	//Объект.НомерКолонкиДатаАкта      = 25;
	//Объект.НомерКолонкиНомерАкта     = 26;
	//Объект.НомерКолонкиСНаправлением = 9;
	
КонецПроцедуры
